Revit 2016 API
LoadCaseArray.GetEnumerator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator
Visual C++
public:
virtual IEnumerator^ GetEnumerator()
Return Value
Returns a forward moving iterator to the array.
Implements
IEnumerable.GetEnumerator()
See Also
LoadCaseArray Class
Autodesk.Revit.DB.Structure Namespace